<?php
$news_data = array(
    array(
        "publish_date" => "2014-09-05 14:25:00",
        "title" => "У самого синего моря",
        "text" => "Осень в Новосибирске началась с небывалого падения 
            цен на путевки — листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
    array(
        "publish_date" => "2014-09-05 15:25:00",
        "title" => "У самого синего моря 2",
        "text" => "Осень в Новосибирске началась. C небывалого падения 
            цен на путевки. Листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
    array(
        "publish_date" => "2014-09-05 13:25:00",
        "title" => "У самого синего моря 3",
        "text" => "Осень в Новосибирске началась. C небывалого падения 
            цен на путевки. Листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
    array(
        "publish_date" => "2014-09-05 13:25:00",
        "title" => "У самого синего моря 3",
        "text" => "Осень в Новосибирске началась. C небывалого падения 
            цен на путевки. Листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
    array(
        "publish_date" => "2014-09-05 13:25:00",
        "title" => "У самого синего моря 3",
        "text" => "Осень в Новосибирске началась. C небывалого падения 
            цен на путевки. Листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
    array(
        "publish_date" => "2014-09-05 13:25:00",
        "title" => "У самого синего моря 3",
        "text" => "Осень в Новосибирске началась. C небывалого падения 
            цен на путевки. Листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
    array(
        "publish_date" => "2014-09-05 13:25:00",
        "title" => "У самого синего моря 3",
        "text" => "Осень в Новосибирске началась. C небывалого падения 
            цен на путевки. Листья еще не осыпались, а стоимость отдыха 
            в Европе и Юго-Восточной Азии поползла вниз. Отпускников напугали 
            банкротства компаний и нестабильная ситуация в экономике. 
            Чтобы вернуть клиентов, туроператоры работают себе в убыток, 
            но копеечные туры еще больше отпугивают покупателей."
    ),
);
/**
 * mysql> insert into news (publish_date,title,text) values ('2014-09-19 12:00:00', 'Они превратили жизнь его в кошмар','Экс-губернатор Новосибирской области Василий Юрченко впервые после отставки созвал пресс-конференцию. Он сообщил, что нашел виновного в своих злоключениях, и покинул зал, не ответив на вопросы журналистов. Его адвокат Александр Балян раскрыл позицию защиты — обвинения в адрес бывшего губернатора несостоятельны. К ответственности нужно привлечь следователя, из-за которого информация о банковских счетах семьи Юрченко просочилась в интернет. Самые интересные выдержки из выступления Василия Юрченко и его адвоката — в материале НГС.НОВОСТИ');
Query OK, 1 row affected, 2 warnings (0.00 sec)

mysql> insert into news (publish_date,title,text) values ('2014-09-19 11:00:00', 'Ты меня убиваешь','За полгода в Новосибирской области совершили на 6 % больше убийств, чем в прошлом году за тот же срок. Раньше кривая неуклонно шла вниз — с 2006 года убийств стало почти в 2 раза меньше. По статистике, мужчин убивают в 3 раза чаще, чем женщин — в колонии сильная половина человечества попадает тоже чаще. Корреспондент НГС.НОВОСТИ попытался составить портрет среднего убийцы из Новосибирска, выяснил, как изменилось в обществе отношение к убийствам и кого лишали жизни больше 100 лет назад жители Ново-Николаевска.');
Query OK, 1 row affected, 2 warnings (0.01 sec)

mysql> insert into news (publish_date,title,text) values ('2014-09-18 11:00:00', 'Будешь вечно жить в страхе','Драка школьников в Ленинском районе закончилась тяжелыми травмами — один из соперников попал в больницу. Социальные педагоги разводят руками — с жестокостью подростков не справиться силой убеждения. Вне школьных стен дерутся даже 6-классники — девочки таскают друг друга за волосы, молодые люди сбиваются в группы, чтобы отбиться от сверстников. Одиночка рискует навсегда лишиться денег, школьных обедов и уважения девушек. Что изменилось за последнее десятилетие в причинах и этикете школьных драк — в материале НГС.НОВОСТИ.');

 */

/**
 * @param $news_element_1
 * @param $news_element_2
 * @return int
 */
$cmp_date = function($news_element_1, $news_element_2){
    $date_1 = $news_element_1['publish_date'];
    $date_2 = $news_element_2['publish_date'];
    
    $timestamp_1 = strtotime($date_1);
    $timestamp_2 = strtotime($date_2);
    
    if( $timestamp_1 === $timestamp_2 ){
        return 0;
    } else {
        return $timestamp_1 < $timestamp_2 ? 1 : -1;
    }    
};
uasort($news_data, $cmp_date);

$data = array();
foreach ($news_data as $newsId => $arNewsItem) {
    $data[] = new NewsItem($newsId, $arNewsItem['publish_date'], $arNewsItem['text'], $arNewsItem['title']);
}

return $data;